{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping features to involved frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing summaries of all major frontend components and pages.",
  "frontend/index.css": "Tailwind base file defining OKLCH color tokens and global styles for light/dark modes.",
  "frontend/index.html": "Root HTML document mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, Catalog, About, and Contact using SiteLayout.",
  "frontend/src/components/catalog/CatalogToolbar.tsx": "Toolbar with search input and sort dropdown for filtering and ordering catalog items.",
  "frontend/src/components/catalog/ProductCard.tsx": "Card component showing product image, name, description, price, and an optional badge.",
  "frontend/src/components/contact/ContactForm.tsx": "Client‑side validated contact form with success state and no external submission.",
  "frontend/src/components/layout/BrandMark.tsx": "Logo component displaying branding image from siteContent.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout providing header, navigation, mobile menu, footer, and Outlet for pages.",
  "frontend/src/components/marketing/CollectionHighlights.tsx": "Renders a grid of collection cards using siteContent, showing images, names, counts, and descriptions.",
  "frontend/src/components/marketing/HeroSection.tsx": "Displays the homepage hero section with background image, headline text, and CTA buttons.",
  "frontend/src/content/noxContent.ts": "Defines all static site content including hero text, collections, products, and branding configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that the site uses static content and no backend queries.",
  "frontend/src/index.css": "Global Tailwind styles and custom CSS variables defining the site's light and dark color systems.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with brand story, promises, features, and owner information sourced from siteContent.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a searchable and sortable product catalog using siteContent and renders ProductCard components.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with store details, business hours, and a contact form using siteContent data and UI components.",
  "frontend/src/pages/HomePage.tsx": "Implements the Home page featuring a hero section, featured products, and collection highlights driven by siteContent configuration.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s state, goals, required images, existing features, and architectural notes for the NOX_WATCH website."
}